Repository: sprvtelida/DigitalLibrary
Catalog: DigitalLibrary.API/Localization/Resources/CustomIdentityResource.*.resx
Languages: kk, ru

# DefaultError
source: An unknown failure has occurred.
kk: Белгісіз қате пайда болды.
ru: Произошла неизвестная ошибка.

# DuplicateEmail
source: Email '{0}' is already taken.
kk: '{0}' электрондық поштасы бос емес.
ru: Эл. почта '{0}' уже занят.

# DuplicateUserName
source: User Name '{0}' is already taken.
kk: '{0}' логині бос емес.
ru: Имя пользователя '{0}' уже занят.

# InvalidEmail
source: Email '{0}' is invalid.
kk: '{0}' электрондық поштасы жарамсыз.
ru: Электронная почта '{0}' недействительна.

source: Invalid token.
kk: Қате токен.
ru: Неверный токен.

# InvalidUserName
source: User name '{0}' is invalid, can only contain letters or digits.
kk: '{0}' пайдаланушы аты жарамсыз, тек әріптер немесе сандар қолданылуы мүмкін.
ru: Имя пользователя '{0}' недействителен, может содержать только буквы или цифры.

# LoginAlreadyAssociated
source: A user with this login already exists.
kk: Мұндай логині бар пайдаланушы бұрыннан бар.
ru: Пользователь с таким логином уже существует.

# PasswordMismatch
source: Incorrect password.
kk: Қате пароль.
ru: Неверный пароль.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
kk: Пароль кем дегенде бір саннан тұруы керек ('0'-'9').
ru: Пароль должен состоять как минимум из одной цифры ('0'-'9').

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
kk: Парольде кем дегенде бір кіші әріп болуы керек ('a'-'z').
ru: В пароле должна быть хотя бы одна строчная буква ('a'-'z').

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
kk: Парольдерде кем дегенде бір әріптік-сандық емес таңба болуы керек.
ru: Пароли должен содержать хотя бы один не буквенно-цифровой символ.

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
kk: Құпия сөз кем дегенде бір бас әріптен тұруы керек ('A'-'Z').
ru: Пароль должен содержать хотя бы одну заглавную букву ('A'-'Z').

# PasswordTooShort
source: Passwords must be at least '{0}' characters.
kk: Пароль кемінде '{0}' таңбадан тұруы керек.
ru: Пароль должен содержать не менее '{0}' символов.

# UserAlreadyHasPassword
source: User already has a password set.
kk: Пайдаланушы құпия сөзді орнатып қойған.
ru: У пользователя уже установлен пароль.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
kk: Бұл пайдаланушы үшін құлыптау өшірілген.
ru: Для этого пользователя отключена блокировка.

# Failed
source: Credentials is not correct.
kk: Кіру деректері дұрыс емес.
ru: Данные для входа не верны.

# LockedOut
source: To many attempts. User is locked out.
kk: Пайдаланушы бұғатталған.
ru: Пользователь заблокирован.

# NotAllowed
source: Account not verified.
kk: Аккаунт расталмаған.
ru: Аккаунт не подтвержден.

# ConfirmationEmailSent
source: A message with a link to verify account has been sent to your email.
kk: Аккаунтты растайтын сілтеме бар хабарлама электрондық поштаға жіберілді.
ru: Сообщение со ссылкой для подтверждения аккаунта была отправлена на почту.

# Required
source: Field is required.
kk: Өрісті толтыру қажет.
ru: Поле необходимо заполнить.

# RestoreLink
source: Go to link to restore your password: {0}, if you did'nt request password restore ignore this message.
kk: Құпия сөзді өзгерту үшін сілтеме арқылы өтіңіз: {0}, егер сіз құпия сөзді өзгертуді сұрамасаңыз, бұл хабарды елемеңіз.
ru: Перейдите по ссылке для восстановления пароля: {0}, если вы не запрашивали восстановление пароля, проигнорируйте это сообщение.

# Password Restore
source: Password reset link
kk: Парольді өзгерту сілтемесі
ru: Ссылка для сброса пароля

# PasswordResetEmailSent
source: A message with a link to reset your password has been sent to your email.
kk: Құпия сөзді өзгерту сілтемесі сіздің электрондық поштаңызға жіберілді.
ru: На вашу электронную почту было отправлено сообщение со ссылкой для сброса пароля.

# PasswordChanged
source: The password was successfully changed.
kk: Пароль сәтті өзгертілді.
ru: Пароль был успешно изменен.

# EmailConfirmed
source: The email address has been successfully verified.
kk: Электрондық пошта адресі сәтті расталды.
ru: Адрес электронной почты успешно подтвержден.

source: Email is invalid or not found.
kk: Электрондық пошта жарамсыз немесе табылмады.
ru: Электронная почта недействительна или не найдена.

# ConfirmEmailLink
source: Follow the link to verify your email address: {0}.
kk: Электрондық пошта адресін растау үшін сілтемеге өтіңіз: {0}.
ru: Перейдите по ссылке чтобы подтвердить адрес электронной почты: {0}.

source: Email confirmation
kk: Электрондық поштаны растау
ru: Подтверждение электонной почты
